# RoomGeometryCannotTrimBoundingElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..RoomGeometryCannotTrimBoundingElement Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
An error occurred while trimming the vertical shadow of a room-bounding element [Name] of the bounding geometry for [Room].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomGeometryCannotTrimBoundingElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomGeometryCannotTrimBoundingElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomGeometryCannotTrimBoundingElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace